% family.ml — родинне дерево біблійних патріархів
% Демонструє: уніфікацію зі змінними, рекурсію

% Факти — батьківські зв'язки
батько(авраам, ісак).
батько(ісак, яків).
батько(яків, йосип).
батько(яків, веніамін).

мати(сарра, ісак).
мати(ревека, яків).
мати(рахіль, йосип).
мати(рахіль, веніамін).

% Правила
правило тато(?x, ?y) якщо батько(?x, ?y).
правило мама(?x, ?y) якщо мати(?x, ?y).
правило предок(?x, ?y) якщо батько(?x, ?y).
правило предок(?x, ?z) якщо батько(?x, ?y) і предок(?y, ?z).

% Запити
?- тато(?x, ісак).
?- предок(авраам, йосип).
?- предок(авраам, ?x).
